<center>
<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/module_1/images/SN_web_lightmode.png" width="300"> 
</center>

# Assignment: Exploratory Data Analysis with SQL
Estimated time needed: 60 minutes


# Introduction
Using this R notebook you will perform exploratory data analysis tasks using SQL queries with the RODBC R package. You will not be graded here, but you will be asked to present some of these results in your final assignment, where you will be graded on the accuracy of your results as well as the content of your SQL queries.

### Establish your Db2 connection
Load the 'RODBC' library, and use the 'odbcConnect( )' function as you did in the previous lab to establish the connection to your Db2 assets.  
Provided you successfully loaded your data into the tables in that lab, you are now ready to start running SQL queries using the RODBC library as you did in Course 3.

In [1]:
# provide your solution here

In [2]:
library(RODBC);

In [3]:
# Establish database connection
dsn_driver <- "{IBM DB2 ODBC Driver}"
dsn_database <- "bludb"            # e.g. "bludb"
dsn_hostname <- "815fa4db-dc03-4c70-869a-a9cc13f33084.bs2io90l08kqb1od8lcg.databases.appdomain.cloud" # e.g "54a2f15b-5c0f-46df-8954-.databases.appdomain.cloud"
dsn_port <- "30367"   # e.g. "32733" 
dsn_protocol <- "TCPIP"            # i.e. "TCPIP"
dsn_uid <- "hdh06323"        # e.g. "zjh17769"
dsn_pwd <- "WZf8AIw179305QUb"      # e.g. "zcwd4+8gbq9bm5k4"  
dsn_security <- "ssl"

conn_path <- paste("DRIVER=",dsn_driver,
                   ";DATABASE=",dsn_database,
                   ";HOSTNAME=",dsn_hostname,
                   ";PORT=",dsn_port,
                   ";PROTOCOL=",dsn_protocol,
                   ";UID=",dsn_uid,
                   ";PWD=",dsn_pwd,
                   ";SECURITY=",dsn_security,        
                   sep="")

conn <- odbcDriverConnect(conn_path)
conn

RODBC Connection 1
Details:
  case=nochange
  DRIVER={IBM DB2 ODBC DRIVER}
  UID=hdh06323
  PWD=******
  DATABASE=bludb
  HOSTNAME=815fa4db-dc03-4c70-869a-a9cc13f33084.bs2io90l08kqb1od8lcg.databases.appdomain.cloud
  PORT=30367
  PROTOCOL=TCPIP
  SECURITY=SSL

In [4]:
sql.info <- sqlTypeInfo(conn)
conn.info <- odbcGetInfo(conn)
conn.info["DBMS_Name"]
conn.info["DBMS_Ver"]
conn.info["Driver_ODBC_Ver"]

       DBMS_Name
"DB2/LINUXX8664"

    DBMS_Ver
"11.05.0800"

Driver_ODBC_Ver
        "03.51"

In [5]:
tab.frame <- sqlTables(conn,schema='DVT13187')
nrow(tab.frame)
tab.frame$TABLE_NAME

[1] 0

character(0)


## Task 1 - Record Count
#### Determine how many records are in the seoul_bike_sharing dataset.

### Solution 1

In [6]:
# provide your solution here
query = "SELECT count(*) FROM seoul_bike_sharing dataset"
    sqlQuery(conn,query)

  1
1 8465

## Task 2 - Operational Hours
#### Determine how many hours had non-zero rented bike count.

### Solution 2

In [7]:
# provide your solution here
query = "SELECT COUNT(HOUR) FROM seoul_bike_sharing dataset 
         WHERE HOUR >0"
    sqlQuery(conn,query)

  1
1 8113

## Task 3 - Weather Outlook
#### Query the the weather forecast for Seoul over the next 3 hours.
Recall that the records in the CITIES_WEATHER_FORECAST dataset are 3 hours apart, so we just need the first record from the query.

### Solution 3

In [8]:
# provide your solution here
query = "SELECT * FROM CITIES_WEATHER_FORECAST LIMIT 1  "
    sqlQuery(conn,query)

  CITY  WEATHER VISIBILITY TEMP  TEMP_MIN TEMP_MAX PRESSURE HUMIDITY WIND_SPEED
1 Seoul Clear   10000      12.32 10.91    12.32    1015     50       2.18
  WIND_DEG SEASON FORECAST_DATETIME
1 248      Spring 2021-04-16 12:00:00

## Task 4 - Seasons
#### Find which seasons are included in the seoul bike sharing dataset.

### Solution 4

In [9]:
# provide your solution here
query = "SELECT DISTINCT(SEASONS) FROM seoul_bike_sharing dataset  "
    sqlQuery(conn,query)

  SEASONS
1 Autumn
2 Spring
3 Summer
4 Winter

## Task 5 - Date Range
#### Find the first and last dates in the Seoul Bike Sharing dataset.

### Solution 5

In [10]:
# provide your solution here
query = "SELECT MAX(DATE) as First_date, MIN(DATE) as Last_date FROM seoul_bike_sharing dataset
        "
    sqlQuery(conn,query)

  FIRST_DATE LAST_DATE
1 31/12/2017 01/01/2018

## Task 6 - Subquery - 'all-time high'
#### determine which date and hour had the most bike rentals.

### Solution 6

In [11]:
# provide your solution here
query = "SELECT DATE, HOUR, RENTED_BIKE_COUNT FROM seoul_bike_sharing dataset
         ORDER BY RENTED_BIKE_COUNT DESC LIMIT 1
        "
    sqlQuery(conn,query)

  DATE       HOUR RENTED_BIKE_COUNT
1 19/06/2018 18   3556

## Task 7 - Hourly popularity and temperature by season
#### Determine the average hourly temperature and the average number of bike rentals per hour over each season. List the top ten results by average bike count.

### Solution 7

In [12]:
# provide your solution here
query = "SELECT  HOUR AS HOUR_Autumn, AVG(TEMPERATURE) AS AVG_TEMPERATURE, AVG (RENTED_BIKE_COUNT) AS AVG_RENTED_BIKE_COUNT FROM seoul_bike_sharing dataset
         WHERE SEASONS=  'Autumn'
         GROUP BY HOUR
         ORDER BY AVG_RENTED_BIKE_COUNT DESC LIMIT 10
        
        "
    sqlQuery(conn,query)


query = "SELECT  HOUR AS HOUR__Spring, AVG(TEMPERATURE) AS AVG_TEMPERATURE, AVG (RENTED_BIKE_COUNT) AS AVG_RENTED_BIKE_COUNT FROM seoul_bike_sharing dataset
         WHERE SEASONS=  'Spring'
         GROUP BY HOUR
         ORDER BY AVG_RENTED_BIKE_COUNT DESC LIMIT 10
        "
    sqlQuery(conn,query)

query = "SELECT  HOUR AS HOUR__Summer, AVG(TEMPERATURE) AS AVG_TEMPERATURE, AVG (RENTED_BIKE_COUNT) AS AVG_RENTED_BIKE_COUNT FROM seoul_bike_sharing dataset
         WHERE SEASONS=  'Summer'
         GROUP BY HOUR
         ORDER BY AVG_RENTED_BIKE_COUNT DESC LIMIT 10
        "
    sqlQuery(conn,query)

query = "SELECT  HOUR AS HOUR__Winter, AVG(TEMPERATURE) AS AVG_TEMPERATURE, AVG (RENTED_BIKE_COUNT) AS AVG_RENTED_BIKE_COUNT FROM seoul_bike_sharing dataset
         WHERE SEASONS=  'Winter'
         GROUP BY HOUR
         ORDER BY AVG_RENTED_BIKE_COUNT DESC LIMIT 10
        "
    sqlQuery(conn,query)

   HOUR_AUTUMN AVG_TEMPERATURE AVG_RENTED_BIKE_COUNT
1  18          16.03086        1983
2  17          17.27778        1562
3  19          15.06049        1515
4   8          10.55679        1345
5  20          14.32469        1321
6  16          18.08025        1293
7  21          13.69012        1253
8  15          18.34321        1156
9  22          13.09012        1130
10 14          18.15185        1058

   HOUR__SPRING AVG_TEMPERATURE AVG_RENTED_BIKE_COUNT
1  18           15.97222        1689
2  17           16.87889        1307
3  19           14.67667        1247
4  16           17.35889        1101
5  20           13.57444        1060
6   8           10.30778        1036
7  21           12.83778        1021
8  15           17.51111         990
9  14           17.36000         925
10 22           12.25222         897

   HOUR__SUMMER AVG_TEMPERATURE AVG_RENTED_BIKE_COUNT
1  18           29.38696        2135
2  19           28.27283        1889
3  20           27.06630        1801
4  21           26.27826        1754
5  22           25.69891        1567
6  17           30.07500        1526
7   8           24.53587        1418
8  16           30.48804        1174
9  23           25.23043        1153
10 15           30.49022        1009

   HOUR__WINTER AVG_TEMPERATURE AVG_RENTED_BIKE_COUNT
1  18           -0.8355556      438
2   8           -5.3266667      422
3  17            0.1400000      342
4  16            0.9822222      308
5  19           -1.5166667      304
6  15            1.1666667      298
7  14            0.8711111      284
8  13            0.2166667      275
9  12           -0.5666667      263
10  9           -4.8022222      254

In [13]:
query = "SELECT  HOUR AS HOUR__Summer, AVG(TEMPERATURE) AS AVG_TEMPERATURE, AVG (RENTED_BIKE_COUNT) AS AVG_RENTED_BIKE_COUNT FROM seoul_bike_sharing dataset
         WHERE SEASONS=  'Summer'
         GROUP BY HOUR
         ORDER BY AVG_RENTED_BIKE_COUNT DESC LIMIT 10
        "
    sqlQuery(conn,query)

   HOUR__SUMMER AVG_TEMPERATURE AVG_RENTED_BIKE_COUNT
1  18           29.38696        2135
2  19           28.27283        1889
3  20           27.06630        1801
4  21           26.27826        1754
5  22           25.69891        1567
6  17           30.07500        1526
7   8           24.53587        1418
8  16           30.48804        1174
9  23           25.23043        1153
10 15           30.49022        1009

## Task 8 - Rental Seasonality
#### Find the average hourly bike count during each season. 
Also include the minimum, maximum, and standard deviation of the hourly bike count for each season.

### Solution 8

In [14]:
# provide your solution here
query = "SELECT   SEASONS,  AVG (RENTED_BIKE_COUNT) AS AVG_RENTED_BIKE_COUNT ,
                   MAX(RENTED_BIKE_COUNT) AS Max_Rented_BIKE, 
                   MIN(RENTED_BIKE_COUNT) AS MIN_Rented_BIKE,
                   STDDEV(RENTED_BIKE_COUNT) AS standard_Deviation

                   FROM seoul_bike_sharing dataset
                   GROUP BY SEASONS
       
        "
    sqlQuery(conn,query)

  SEASONS AVG_RENTED_BIKE_COUNT MAX_RENTED_BIKE MIN_RENTED_BIKE
1 Autumn   924                  3298            2
2 Spring   746                  3251            2
3 Summer  1034                  3556            9
4 Winter   225                   937            3
  STANDARD_DEVIATION
1 617.3885
2 618.5247
3 690.0884
4 150.3374

Let's explore a bit and see what might be the most significant contributing factors in terms of the provided data.

## Task 9 - Weather Seasonality
#### Consider the weather over each season. On average, what were the TEMPERATURE, HUMIDITY, WIND_SPEED, VISIBILITY, DEW_POINT_TEMPERATURE, SOLAR_RADIATION, RAINFALL, and SNOWFALL per season?
Include the average bike count as well , and rank the results by average bike count so you can see if it is correlated with the weather at all.

### Solution 9

In [15]:
query = "SELECT  SEASONS,
                 AVG(RENTED_BIKE_COUNT) AS AVG_RENTED_BIKE_COUNT,
                 AVG(TEMPERATURE) AS AVG_TEMPERATURE, 
                 AVG(HUMIDITY) AS AVG_HUMIDITY, 
                 AVG(WIND_SPEED) AS AVG_WIND_SPEED,
                 AVG(VISIBILITY) AS AVG_VISIBILITY, 
                 AVG(DEW_POINT_TEMPERATURE) AS AVG_DEW_POINT_TEMPERATURE, 
                 AVG(SOLAR_RADIATION) AS AVG_SOLAR_RADIATION, 
                 AVG(RAINFALL) AS AVG_RAINFALL, 
                 AVG(SNOWFALL) AS AVG_SNOWFALL 
        FROM seoul_bike_sharing dataset
        GROUP BY SEASONS
         
        "
    sqlQuery(conn,query)

  SEASONS AVG_RENTED_BIKE_COUNT AVG_TEMPERATURE AVG_HUMIDITY AVG_WIND_SPEED
1 Autumn   924                  13.821167       59           1.492101
2 Spring   746                  13.021389       58           1.857778
3 Summer  1034                  26.587274       64           1.609420
4 Winter   225                  -2.540463       49           1.922685
  AVG_VISIBILITY AVG_DEW_POINT_TEMPERATURE AVG_SOLAR_RADIATION AVG_RAINFALL
1 1558             5.150594                0.5227827           0.11765617
2 1240             4.091389                0.6803009           0.18694444
3 1501            18.750136                0.7612545           0.25348732
4 1445           -12.416667                0.2981806           0.03282407
  AVG_SNOWFALL
1 0.06350026
2 0.00000000
3 0.00000000
4 0.24750000

## Task 10 - Total Bike Count and City Info for Seoul
#### Use an implicit join across the WORLD_CITIES and the BIKE_SHARING_SYSTEMS tables to determine the total number of bikes avaialble in Seoul, plus the following city information about Seoul: CITY, COUNTRY, LAT, LON, POPULATION, in a single view.
Notice that in this case, the CITY column will work for the WORLD_CITIES table, but in general you would have to use the CITY_ASCII column.

### Solution 10

In [16]:
# provide your solution here
query = "SELECT  B.CITY, W.COUNTRY, W.LAT, W.LNG, W.POPULATION,  B.BICYCLES FROM BIKE_SHARING_SYSTEMS B,  WORLD_CITIES W
         WHERE B.CITY=W.CITY_ASCII AND B.CITY='Seoul'
"
    sqlQuery(conn,query)

  CITY  COUNTRY      LAT   LNG POPULATION BICYCLES
1 Seoul Korea, South 37.58 127 21794000   20000

## Task 11 - Find all city names and coordinates with comparable bike scale to Seoul's bike sharing system
#### Find all cities with total bike counts between 15000 and 20000. Return the city and country names, plus the coordinates (LAT, LNG), population, and number of bicycles for each city.
Later we will ask you to visualize these similar cities on leaflet, with some weather data.

### Solution 11

In [17]:
# provide your solution here
query = " WITH comparable_cities AS
         (
         SELECT  B.CITY, W.COUNTRY, W.LAT, W.LNG, W.POPULATION,  B.BICYCLES AS BICYCLES 
         FROM BIKE_SHARING_SYSTEMS B,  WORLD_CITIES W
         WHERE   B.CITY=W.CITY_ASCII AND BICYCLES != 'NA'
        )

       SELECT *
       FROM comparable_cities
       WHERE BICYCLES BETWEEN 15000 AND 20000
       ORDER BY BICYCLES DESC
         
"
    sqlQuery(conn,query)

  CITY     COUNTRY      LAT   LNG    POPULATION BICYCLES
1 Seoul    Korea, South 37.58 127.00 21794000   20000
2 Weifang  China        36.71 119.10  9373000   20000
3 Xi'an    China        34.26 108.90  7135000   20000
4 Zhuzhou  China        27.84 113.14  3855609   20000
5 Shanghai China        31.16 121.46 22120000   19165
6 Beijing  China        39.90 116.39 19433000   16000
7 Ningbo   China        29.87 121.54  7639000   15000

In [18]:
query = " WITH comparable_cities AS
         (
         SELECT  B.CITY, W.COUNTRY, W.LAT, W.LNG, W.POPULATION,  B.BICYCLES AS BICYCLES 
         FROM BIKE_SHARING_SYSTEMS B,  WORLD_CITIES W
         WHERE   B.CITY=W.CITY_ASCII AND BICYCLES != 'NA'
        )

       SELECT CITY,  SUM(BICYCLES)  AS BICYCLES
       FROM comparable_cities
       GROUP BY CITY 
       HAVING  SUM(BICYCLES) BETWEEN 15000 AND 20000
       ORDER BY BICYCLES DESC
         
"
    sqlQuery(conn,query)

  CITY     BICYCLES
1 Seoul    20000
2 Weifang  20000
3 Xi'an    20000
4 Zhuzhou  20000
5 Shanghai 19165
6 Beijing  16000
7 Ningbo   15000

In [19]:
close(conn)

## Author(s)

<h4> Jeff Grossman </h4>

## Contributor(s)

<h4> Yan Luo, Rav Ahuja </h4>

## Change log

| Date       | Version | Changed by    | Change Description                                                                |
| ---------- | ------- | ------------- | --------------------------------------------------------------------------------- |
| 2021-05-04 | 0.2     | Jeff Grossman | Finalize                               |
| 2021-04-22 | 0.2     | Jeff Grossman | Update as per peer review                               |
| 2021-04-10 | 0.2     | Jeff Grossman | Add data sources and implicit joins                                  |
| 2021-04-05 | 0.1     | Jeff Grossman | Start content creation                                                          |


## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>